# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Import pandas

In [37]:
# your code here
import pandas as pd
import os

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DB Management System and then use it in your notebook).

In [38]:
os.chdir('C:\\Users\\mailb\\Anaconda3\\Lib\\site-packages')
import pymysql
from sqlalchemy import create_engine
import getpass

In [ ]:
Hostname = 'localhost'
username = 'root'
password = getpass.getpass()
database = 'sakila'

In [ ]:
engine = create_engine(f"mysql+pymysql://{username}:{password}@{Hostname}/{database}")

In [145]:
sakila_actor_table = pd.read_sql_table('actor', engine)
sakila_actor_table

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [146]:
sakila_actor_table.shape

(200, 4)

In [143]:
sakila_query = pd.read_sql_query ('select actor.actor_id, actor.last_name, film.title, film.release_year, film.length from sakila.actor inner join film_actor on actor.actor_id = film_actor.actor_id left join film on film.film_id = film_actor.film_id group by film.film_id order by actor.actor_id;', engine)
sakila_query.shape

(997, 5)

# Challenge 2 - Working with JSON files

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [56]:
# your code here
nasa = pd.read_json('nasa.json', orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [58]:
# your code here
nasa.head(3)

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000

In [131]:
nasa.index

RangeIndex(start=0, stop=1000, step=1)

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [59]:
# your code here
nasa["fall"].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [66]:
# your code here
nasa.to_json('nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it.

We define the URL of the data and the column names below. Following this, read the tst file to a variable called `shuttle`. Since the file does not contain any header or column names, you must add the column names yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [133]:
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'
# your code here
shuttle = pd.read_csv(tst_url, sep = ' ', header=None)
shuttle.index

RangeIndex(start=0, stop=14500, step=1)

In [111]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'other','class']
shuttle.columns = cols

Let's verify that this worked by looking at the `head()` function.

In [95]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,other,class
0,56,0,96,0,52,-4,40,44,4,4
1,50,-1,89,-7,50,0,39,40,2,1
2,53,9,79,0,42,-2,25,37,12,4
3,55,2,82,0,54,-6,26,28,2,1
4,41,0,84,3,38,-4,43,45,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [96]:
# your code here
shuttle.to_csv('shuttle.csv', index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [99]:
import xlrd

In [100]:
# your code here
astronaut = pd.read_excel("astronauts.xls")

Use the `head()` function to inspect the dataframe.

In [134]:
# your code here
astronaut.head()
astronaut.index

RangeIndex(start=0, stop=357, step=1)

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [104]:
# your code here
astronaut["Undergraduate Major"].value_counts()

Physics                                             35
Aerospace Engineering                               33
Mechanical Engineering                              30
Aeronautical Engineering                            28
Electrical Engineering                              23
                                                    ..
Philosophy                                           1
Business Economics                                   1
Engineering Sciences; Astronautics & Mathematics     1
Marine Engineering & Nautical Science                1
Geosciences                                          1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [114]:
# your code here
astronaut.to_csv("astronaut_ouput.csv", sep = '\t', index = False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [117]:
# your code here
fertility = pd.read_csv('fertility_Diagnosis.txt', sep=",", header=None)
print(df)

       0     1  2  3  4  5    6  7     8  9
0  -0.33  0.69  0  1  1  0  0.8  0  0.88  N
1  -0.33  0.94  1  0  1  0  0.8  1  0.31  O
2  -0.33  0.50  1  0  0  0  1.0 -1  0.50  N
3  -0.33  0.75  0  1  1  0  1.0 -1  0.38  N
4  -0.33  0.67  1  1  0  0  0.8 -1  0.50  O
..   ...   ... .. .. .. ..  ... ..   ... ..
95 -1.00  0.67  1  0  0  0  1.0 -1  0.50  N
96 -1.00  0.61  1  0  0  0  0.8  0  0.50  N
97 -1.00  0.67  1  1  1  0  1.0 -1  0.31  N
98 -1.00  0.64  1  0  1  0  1.0  0  0.19  N
99 -1.00  0.69  0  1  1  0  0.6 -1  0.19  N

[100 rows x 10 columns]

In [122]:
colnames = ['Season', 'Age at time of analysis', 'Childish diseases', 'Accident or serious trauma', 'Surgical intervention', 'High fevers in the last year', 'Frequency of alcohol consumption', 'Smoking habit', 'Number of hours spent sitting per day', 'Output: Diagnosis normal (N), altered (O)']
df.columns = colnames
df

,Season,Age at time of analysis,Childish diseases,Accident or serious trauma,Surgical intervention,High fevers in the last year,Frequency of alcohol consumption,Smoking habit,Number of hours spent sitting per day,"Output: Diagnosis normal (N), altered (O)"
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O
...,...,...,...,...,...,...,...,...,...,...
95,-1.00,0.67,1,0,0,0,1.0,-1,0.50,N
96,-1.00,0.61,1,0,0,0,0.8,0,0.50,N
97,-1.00,0.67,1,1,1,0,1.0,-1,0.31,N
98,-1.00,0.64,1,0,1,0,1.0,0,0.19,N
99,-1.00,0.69,0,1,1,0,0.6,-1,0.19,N

In [141]:
sorted_df = df.sort_values(by='Output: Diagnosis normal (N), altered (O)', ascending=False)
sorted_df.head(13)

,Season,Age at time of analysis,Childish diseases,Accident or serious trauma,Surgical intervention,High fevers in the last year,Frequency of alcohol consumption,Smoking habit,Number of hours spent sitting per day,"Output: Diagnosis normal (N), altered (O)"
27,1.00,0.78,1,1,0,1,0.6,-1,0.38,O
26,1.00,0.67,1,0,1,0,0.6,-1,0.38,O
19,1.00,0.67,1,0,0,0,0.8,1,0.38,O
38,-1.00,0.67,0,0,1,0,0.6,0,0.50,O
70,-0.33,0.50,1,1,0,-1,0.8,0,0.88,O
23,1.00,0.69,1,0,1,-1,1.0,-1,0.44,O
17,1.00,0.69,1,0,1,0,0.8,-1,0.25,O
93,0.33,0.75,1,0,1,0,0.8,-1,0.44,O
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O
29,1.00,0.67,0,0,1,0,0.6,0,0.50,O
84,-0.33,0.78,1,0,0,1,1.0,1,0.06,O
73,-1.00,0.50,1,0,0,1,0.8,-1,0.44,N